Kelvin_Helmholtz_Instability/KelvinHelmholtzInstability_fineMesh/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.1.1                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location "0";
    object p_rgh;
}
dimensions [ 1 -1 -2 0 0 0 0 ];
internalField uniform 0.0;
boundaryField
{
    wall
    {
        type fixedFluxPressure;
        value uniform 0;
    }

    zminus
    {
        type fixedFluxPressure;
        value uniform 0;
    }

    zplus
    {
        type fixedFluxPressure;
        value uniform 0;
    }

}
